In [3]:
import sqlite3 as sql
import pandas as pd

conn = sql.connect("database.db")
cursor = conn.cursor()

In [4]:
cursor.execute("DROP TABLE IF EXISTS employee;")

cursor.execute("""
CREATE TABLE employee (
    employee_id INTEGER,
    employee_name TEXT
    );""")

conn.commit()

In [5]:
cursor.execute("DROP TABLE IF EXISTS department;")

cursor.execute("""
CREATE TABLE department (
    employee_name TEXT,
    department TEXT
    );""")

conn.commit()

In [6]:
cursor.execute("DROP TABLE IF EXISTS female;")

cursor.execute("""
CREATE TABLE female (
    name TEXT
    );""")

conn.commit()

In [7]:
cursor.execute("DROP TABLE IF EXISTS male;")

cursor.execute("""
CREATE TABLE male (
    name TEXT
    );""")

conn.commit()

In [8]:
cursor.execute("DROP TABLE IF EXISTS project;")

cursor.execute("""
CREATE TABLE project (
    project TEXT
    );""")

conn.commit()

In [9]:
cursor.execute("DROP TABLE IF EXISTS salary;")

cursor.execute("""
CREATE TABLE salary (
    employee_name TEXT,
    salary INTEGER
    );""")

conn.commit()

In [10]:
cursor.execute("DROP TABLE IF EXISTS supervise;")

cursor.execute("""
CREATE TABLE supervise (
    supervisor TEXT,
    subordinate TEXT
    );""")

conn.commit()

In [11]:
cursor.execute("DROP TABLE IF EXISTS workson;")

cursor.execute("""
CREATE TABLE workson (
    name TEXT,
    project TEXT,
    effort INTEGER
    );""")

conn.commit()

In [12]:
cursor.execute("INSERT INTO employee VALUES (1,'john');")
cursor.execute("INSERT INTO employee VALUES (2, 'franklin');")
cursor.execute("INSERT INTO employee VALUES (3, 'alicia');")
cursor.execute("INSERT INTO employee VALUES (4, 'jennifer');")
cursor.execute("INSERT INTO employee VALUES (5, 'ramesh');")
cursor.execute("INSERT INTO employee VALUES (6, 'joyce');")
cursor.execute("INSERT INTO employee VALUES (7, 'ahmad');")
cursor.execute("INSERT INTO employee VALUES (8, 'james');")

In [13]:
cursor.execute("INSERT INTO department VALUES ('john', 'research');")
cursor.execute("INSERT INTO department VALUES ('franklin', 'research');")
cursor.execute("INSERT INTO department VALUES ('alicia', 'administration');")
cursor.execute("INSERT INTO department VALUES ('jennifer', 'administration');")
cursor.execute("INSERT INTO department VALUES ('ramesh', 'research');")
cursor.execute("INSERT INTO department VALUES ('joyce', 'research');")
cursor.execute("INSERT INTO department VALUES ('ahmad', 'administration');")
cursor.execute("INSERT INTO department VALUES ('james', 'headquarters');")

In [14]:
cursor.execute("INSERT INTO female VALUES ('alicia');")
cursor.execute("INSERT INTO female VALUES ('jennifer');")
cursor.execute("INSERT INTO female VALUES ('joyce');")

In [15]:
cursor.execute("INSERT INTO male VALUES ('john');")
cursor.execute("INSERT INTO male VALUES ('franklin');")
cursor.execute("INSERT INTO male VALUES ('ramesh');")
cursor.execute("INSERT INTO male VALUES ('ahmad');")
cursor.execute("INSERT INTO male VALUES ('james');")

In [16]:
cursor.execute("INSERT INTO project VALUES ('productx');")
cursor.execute("INSERT INTO project VALUES ('producty');")
cursor.execute("INSERT INTO project VALUES ('productz');")
cursor.execute("INSERT INTO project VALUES ('computerization');")
cursor.execute("INSERT INTO project VALUES ('reorganization');")
cursor.execute("INSERT INTO project VALUES ('newbenefits');")

In [17]:
cursor.execute("INSERT INTO salary VALUES ('john', 30000);")
cursor.execute("INSERT INTO salary VALUES ('franklin', 40001);")
cursor.execute("INSERT INTO salary VALUES ('alicia', 25000);")
cursor.execute("INSERT INTO salary VALUES ('jennifer', 43000);")
cursor.execute("INSERT INTO salary VALUES ('ramesh', 38000);")
cursor.execute("INSERT INTO salary VALUES ('joyce', 25000);")
cursor.execute("INSERT INTO salary VALUES ('ahmad', 25000);")
cursor.execute("INSERT INTO salary VALUES ('james', 55000);")

In [18]:
cursor.execute("INSERT INTO supervise VALUES ('franklin', 'john');")
cursor.execute("INSERT INTO supervise VALUES ('franklin', 'ramesh');")
cursor.execute("INSERT INTO supervise VALUES ('franklin', 'joyce');")
cursor.execute("INSERT INTO supervise VALUES ('jennifer', 'alicia');")
cursor.execute("INSERT INTO supervise VALUES ('jennifer', 'ahmad');")
cursor.execute("INSERT INTO supervise VALUES ('james', 'franklin');")
cursor.execute("INSERT INTO supervise VALUES ('james', 'jennifer');")

In [19]:
cursor.execute("INSERT INTO workson VALUES ('john', 'productx', 32);")
cursor.execute("INSERT INTO workson VALUES ('john', 'producty', 8);")
cursor.execute("INSERT INTO workson VALUES ('ramesh', 'productz', 40);")
cursor.execute("INSERT INTO workson VALUES ('joyce', 'productx', 20);")
cursor.execute("INSERT INTO workson VALUES ('joyce', 'producty', 20);")
cursor.execute("INSERT INTO workson VALUES ('franklin', 'producty', 10);")
cursor.execute("INSERT INTO workson VALUES ('franklin', 'productz', 10);")
cursor.execute("INSERT INTO workson VALUES ('franklin', 'computerization', 10);")
cursor.execute("INSERT INTO workson VALUES ('franklin', 'reorganization', 10);")
cursor.execute("INSERT INTO workson VALUES ('alicia', 'newbenefits', 30);")
cursor.execute("INSERT INTO workson VALUES ('alicia', 'computerization', 10);")
cursor.execute("INSERT INTO workson VALUES ('ahmad', 'computerization', 35);")
cursor.execute("INSERT INTO workson VALUES ('ahmad', 'newbenefits', 5);")
cursor.execute("INSERT INTO workson VALUES ('jennifer', 'newbenefits', 20);")
cursor.execute("INSERT INTO workson VALUES ('jennifer', 'reorganization', 15);")
cursor.execute("INSERT INTO workson VALUES ('james', 'reorganization', 10);")

In [20]:
pd.read_sql_query("SELECT * FROM employee;", conn, index_col='employee_id')

            employee_name
employee_id
1                    john
2                franklin
3                  alicia
4                jennifer
5                  ramesh
6                   joyce
7                   ahmad
8                   james

In [21]:
pd.read_sql_query("SELECT * FROM department;", conn, index_col='employee_name')

                   department
employee_name
john                 research
franklin             research
alicia         administration
jennifer       administration
ramesh               research
joyce                research
ahmad          administration
james            headquarters

In [22]:
pd.read_sql_query("SELECT * FROM department WHERE employee_name LIKE 'j%r';", conn, index_col='employee_name')

                   department
employee_name
jennifer       administration

In [24]:
pd.read_sql_query("SELECT * FROM male, salary WHERE male.name == salary.employee_name AND salary > 40000;", conn)

       name employee_name  salary
0  franklin      franklin   40001
1     james         james   55000